In [275]:
import pandas as pd
import numpy as np

auction = pd.read_csv("C:/Users/Arjun/06_JN/ipl auction stats__static.csv")
auction.head()

,Unnamed: 0,SR. NO.,TEAM,FUNDS REMAINING,OVERSEAS PLAYERS,TOTAL PLAYERS
0,0,NaN,Chennai Super King,29500000.0,8,25.0
1,1,NaN,Delhi Capitals,1000000.0,7,24.0
2,2,NaN,Gujrat Titans,1500000.0,8,23.0
3,3,NaN,Kolkata Knight Riders,4500000.0,8,25.0
4,4,NaN,Lucknow Super Gaints,NaN,7,NaN

In [276]:
auction.isnull()

,Unnamed: 0,SR. NO.,TEAM,FUNDS REMAINING,OVERSEAS PLAYERS,TOTAL PLAYERS
0,False,True,False,False,False,False
1,False,True,False,False,False,False
2,False,True,False,False,False,False
3,False,True,False,False,False,False
4,False,True,False,True,False,True
5,False,True,False,False,False,False
6,False,True,False,False,False,False
7,False,True,False,False,False,False
8,False,True,False,False,False,False
9,False,True,False,False,False,False

In [277]:
auction.isna().any()

Unnamed: 0           False
SR. NO.               True
TEAM                 False
FUNDS REMAINING       True
OVERSEAS PLAYERS     False
TOTAL PLAYERS         True
dtype: bool

In [278]:
auction.isna().sum()

Unnamed: 0            0
SR. NO.              10
TEAM                  0
FUNDS REMAINING       1
OVERSEAS PLAYERS      0
TOTAL PLAYERS         1
dtype: int64

In [279]:
auction.isnull().sum()

Unnamed: 0            0
SR. NO.              10
TEAM                  0
FUNDS REMAINING       1
OVERSEAS PLAYERS      0
TOTAL PLAYERS         1
dtype: int64

In [280]:
auction.notnull().sum()

Unnamed: 0           10
SR. NO.               0
TEAM                 10
FUNDS REMAINING       9
OVERSEAS PLAYERS     10
TOTAL PLAYERS         9
dtype: int64

In [281]:
auction.shape

(10, 6)

#2.1 Drop all rows containing any null values.

In [283]:
drop_auction = auction.dropna(axis=0) 
auction.shape

(10, 6)

2.2 Drop all columns containing any null values.

In [285]:
drop_auction = auction.dropna(axis=1) 
auction.shape

(10, 6)

2.3 Drop rows with at least one missing value.

In [287]:
drop_auction = auction.dropna(how='any')
auction.shape

(10, 6)

2.4 Drop rows only where all values are missing

In [289]:
drop_auction = auction.dropna(how='all')
auction.shape

(10, 6)

2.5 Drop rows based on different threshold values

In [291]:
drop_auction = auction.dropna(thresh=11)
auction.shape

(10, 6)

2.6 Drop rows only when null values are present in a specific subset 
of columns

In [293]:
drop_auction = auction.dropna(subset=['FUNDS REMAINING','TOTAL PLAYERS'])
auction.shape

(10, 6)

3.1 Load the dataset

In [295]:
data=pd.read_csv("C:/Users/Arjun/06_JN/fill_missing_values.csv")
print(data)

   ID     Name   Age          State   Department   Salary Joining_Date
0   1    Aarav  25.0      Karnataka  Engineering  50000.0   15-01-2020
1   2    Aditi   NaN    Maharashtra           HR  55000.0   20-05-2019
2   3  Krishna  30.0      Karnataka  Engineering      NaN   10-06-2021
3   4    Meera  28.0            NaN      Finance  60000.0   01-08-2018
4   5   Ananya  35.0         Kerala      Finance  70000.0          NaN
5   6      NaN  29.0     Tamil Nadu  Engineering  58000.0   05-03-2022
6   7    Rohan  40.0          Delhi    Marketing      NaN   11-12-2017
7   8   Ishita  32.0  Uttar Pradesh      Finance  75000.0   20-10-2019

#3.2 Replace all missing values in the dataset with the value "-1".

In [297]:
data.fillna(-1)

   ID     Name   Age          State   Department   Salary Joining_Date
0   1    Aarav  25.0      Karnataka  Engineering  50000.0   15-01-2020
1   2    Aditi  -1.0    Maharashtra           HR  55000.0   20-05-2019
2   3  Krishna  30.0      Karnataka  Engineering     -1.0   10-06-2021
3   4    Meera  28.0             -1      Finance  60000.0   01-08-2018
4   5   Ananya  35.0         Kerala      Finance  70000.0           -1
5   6       -1  29.0     Tamil Nadu  Engineering  58000.0   05-03-2022
6   7    Rohan  40.0          Delhi    Marketing     -1.0   11-12-2017
7   8   Ishita  32.0  Uttar Pradesh      Finance  75000.0   20-10-2019

3.3 Fill the missing values in the Age column with the mean age of 
all employees

In [299]:
data['Age'].fillna(data['Age'].mean())

0    25.000000
1    31.285714
2    30.000000
3    28.000000
4    35.000000
5    29.000000
6    40.000000
7    32.000000
Name: Age, dtype: float64

3.4 Fill the missing values in the Salary column with the median 
salary of all employees

In [301]:
data['Salary'].fillna(data['Salary'].median())

0    50000.0
1    55000.0
2    59000.0
3    60000.0
4    70000.0
5    58000.0
6    59000.0
7    75000.0
Name: Salary, dtype: float64

3.5 Replace the missing values in the State column with the string 
"Unknown".

In [303]:
data.fillna({'State':"Unknown"})

   ID     Name   Age          State   Department   Salary Joining_Date
0   1    Aarav  25.0      Karnataka  Engineering  50000.0   15-01-2020
1   2    Aditi   NaN    Maharashtra           HR  55000.0   20-05-2019
2   3  Krishna  30.0      Karnataka  Engineering      NaN   10-06-2021
3   4    Meera  28.0        Unknown      Finance  60000.0   01-08-2018
4   5   Ananya  35.0         Kerala      Finance  70000.0          NaN
5   6      NaN  29.0     Tamil Nadu  Engineering  58000.0   05-03-2022
6   7    Rohan  40.0          Delhi    Marketing      NaN   11-12-2017
7   8   Ishita  32.0  Uttar Pradesh      Finance  75000.0   20-10-2019

3.6 Use backward fill to handle missing values in the Joining Date 
column. Print the modified dataset.

In [305]:
data['Joining_Date'].bfill(inplace=True) 
print(data)

   ID     Name   Age          State   Department   Salary Joining_Date
0   1    Aarav  25.0      Karnataka  Engineering  50000.0   15-01-2020
1   2    Aditi   NaN    Maharashtra           HR  55000.0   20-05-2019
2   3  Krishna  30.0      Karnataka  Engineering      NaN   10-06-2021
3   4    Meera  28.0            NaN      Finance  60000.0   01-08-2018
4   5   Ananya  35.0         Kerala      Finance  70000.0   05-03-2022
5   6      NaN  29.0     Tamil Nadu  Engineering  58000.0   05-03-2022
6   7    Rohan  40.0          Delhi    Marketing      NaN   11-12-2017
7   8   Ishita  32.0  Uttar Pradesh      Finance  75000.0   20-10-2019

C:\Users\Arjun\AppData\Local\Temp\ipykernel_12696\1444887061.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Joining_Date'].bfill(inplace=True)

In [306]:
df=data['Salary'].ffill()
print(df)
db=data['Salary'].bfill()
print(db)

0    50000.0
1    55000.0
2    55000.0
3    60000.0
4    70000.0
5    58000.0
6    58000.0
7    75000.0
Name: Salary, dtype: float64
0    50000.0
1    55000.0
2    60000.0
3    60000.0
4    70000.0
5    58000.0
6    75000.0
7    75000.0
Name: Salary, dtype: float64

3.7 Compare the mean salary of the dataset after using forward fill 
and backward fill for handling missing values in the Salary column.

In [308]:
mean_salary_bfill=df.mean()
mean_salary_ffill=db.mean()
print("Mean Salary After Backward Fill:", mean_salary_bfill)
print("Mean Salary After Forward Fill:", mean_salary_ffill)

Mean Salary After Backward Fill: 60125.0
Mean Salary After Forward Fill: 62875.0